In [2]:
import csv
import numpy as np
import pandas as pd
import os

from subprocess import check_output

In [3]:
infileAveHrWageDept = 'City_of_Seattle_Wages__Comparison_by_Gender_-_Average_Hourly_Wage_by_Department-1.csv'
infileWageProgJobTitles = 'City_of_Seattle_Wages___Comparison_by_Gender__Wage_Progression_Job_Titles-1.csv'

In [10]:
dfWageProgJobTitles = pd.read_csv(infileWageProgJobTitles)
dfWageProgJobTitles.head()

,Job Classification,Female Avg Hrly Rate,No. Female Empl,Male Avg Hrly Rate,No. Male Empl,Total Avg Hrly Rate,Total No. Empl,Female to male % rate,Female to male % count,Notes
0,Accountant,30.58,23.0,30.28,7.0,30.51,30,101.0,329.0,NaN
1,"Accountant,Prin",38.75,23.0,37.64,7.0,38.49,30,103.0,329.0,NaN
2,"Accountant,Sr",34.48,23.0,33.89,6.0,34.36,29,102.0,383.0,NaN
3,Act Exec,43.10,4.0,42.02,7.0,42.42,11,103.0,57.0,NaN
4,Actg Tech I,22.56,1.0,NaN,NaN,22.56,1,NaN,NaN,no men in title

In [4]:
dfAveHrWageDept = pd.read_csv(infileAveHrWageDept)
dfAveHrWageDept.head()

,Department,Jobtitle,Female Avg Hrly Rate,No. Female Empl,Male Avg Hrly Rate,No. Male Empl,Total Avg Hrly Rate,Total No. Empl,Total Average of MONTHS LONGEVITY IN CURRENT CLASSIFICATION,Ratio of women's hourly rate to men's hourly rate - percentage,Notes
0,Arts and Cultural Affairs,Accountant,NaN,NaN,29.75,1.0,29.75,1,39.0,NaN,No women in title
1,Arts and Cultural Affairs,Actg Tech III,26.79,1.0,NaN,NaN,26.79,1,56.0,NaN,No men in title
2,Arts and Cultural Affairs,Admin Spec III,26.26,1.0,NaN,NaN,26.26,1,37.0,NaN,No men in title
3,Arts and Cultural Affairs,Admin Staff Asst,31.76,2.0,NaN,NaN,31.76,2,99.0,NaN,No men in title
4,Arts and Cultural Affairs,Arts Conserv Tech,27.78,1.0,27.78,1.0,27.78,2,65.0,100.0,NaN

In [5]:
dfAveHrWageDept.groupby(
   ['Department', 'Jobtitle']
).agg(
    {
         'Total No. Empl':sum,    # Sum duration per group
         'No. Male Empl': "count",  # get the count of females
         'No. Female Empl': "count",  # get the count of males
         
    }
)

                                                      Total No. Empl  \
Department                Jobtitle
Arts and Cultural Affairs Accountant                               1
                          Actg Tech III                            1
                          Admin Spec III                           1
                          Admin Staff Asst                         2
                          Arts Conserv Tech                        2
...                                                              ...
Seattle Public Utilities  Wtrshed Resource Spec                    1
                          Wtrshed Resources Tech                   1
                          Wtrworks Maint Spec,Sr-SMU               2
                          Wtrworks Maint Spec-SMU                  3
                          Wtrworks Maint Supv                      1

                                                      No. Male Empl  \
Department                Jobtitle
Arts and Cultural Affairs Accountant                              1
                          Actg Tech III                           0
                          Admin Spec III                          0
                          Admin Staff Asst                        0
                          Arts Conserv Tech                       1
...                                                             ...
Seattle Public Utilities  Wtrshed Resource Spec                   1
                          Wtrshed Resources Tech                  1
                          Wtrworks Maint Spec,Sr-SMU              1
                          Wtrworks Maint Spec-SMU                 1
                          Wtrworks Maint Supv                     1

                                                      No. Female Empl
Department                Jobtitle
Arts and Cultural Affairs Accountant                                0
                          Actg Tech III                             1
                          Admin Spec III                            1
                          Admin Staff Asst                          1
                          Arts Conserv Tech                         1
...                                                               ...
Seattle Public Utilities  Wtrshed Resource Spec                     0
                          Wtrshed Resources Tech                    0
                          Wtrworks Maint Spec,Sr-SMU                0
                          Wtrworks Maint Spec-SMU                   0
                          Wtrworks Maint Supv                       0

[1646 rows x 3 columns]

In [ ]:
#What is the female to male % average hourly rate by department? (variance in wage) - scatterplot

In [ ]:
#What is the male to female ratio of each deptartment? (choose 2-4 job titles) - pie charts